#Задание. 

print('Введите три произвольных, целых числа.')
a = int(input('Введите первое число: '))
b = int(input('Введите второй число: '))
c = int(input('Введите третье число: '))